frontend/controllers/SearchController.php

            }

            $model = new UserProfile();
            $specialities = MetaValues::find()->orderBy('id asc')
                ->where(['key'=>5])->all();

            $treatments = MetaValues::find()->orderBy('id asc')
                ->where(['key'=>9])->all();
---
SELECT * FROM `meta_values` WHERE `key`=5 ORDER BY `id`
SELECT * FROM `meta_values` WHERE `key`=9 ORDER BY `id`

    public function actionDoctorAddressList(){
        if(Yii::$app->request->isAjax && Yii::$app->request->post()){
            $post=Yii::$app->request->post();
            $date=(isset($post['date']))?date('Y-m-d',strtotime($post['date'])):date('Y-m-d');
            $slug=$post['slug'];
            $doctorProfile=UserProfile::find()->where(['slug'=> $slug])->one();
            if(!empty($doctorProfile)){
                $doctor=User::findOne($doctorProfile->user_id);
---
SELECT * FROM `user_profile` WHERE `slug`='mahesh'
SELECT * FROM `user` WHERE `id`=188