common/components/DrsPanel.php

SELECT `code` AS `id`, `name` FROM `states` WHERE (code != '' ) AND (`status`=1)
---
    public static function getStateList($country_id=NULL){
        if($country_id)
            $result = Countries::find()->where("dialcode != '' ")->andWhere(['dialcode'=>$country_id])->all();
        else
            $result = States::find()->where("code != '' ")->andWhere(['status'=>1])->select(['code as id','name'])->all();

SELECT `id`, `name` FROM `cities` WHERE (`status`=1) AND (`state_id`='24')
---
    public static function getCitiesList($state_id=NULL,$listby=NULL){
        if($state_id){

            $state_id=($listby=='name')?States::getIdByName($state_id):$state_id;
            $result = Cities::find()->where(['status'=>1])->andWhere(['state_id'=>$state_id])->select(['id','name'])->all();

SELECT * FROM `user_profile` WHERE `user_id`=25
---
    public static function getUserName($user_id){
        $profile =  UserProfile::findOne(['user_id' => $user_id]);

SELECT * FROM `user` WHERE (`countrycode`='91') AND (`phone`='1471471471') AND (`groupid`='4')
---
    public static function checkmobileUpdate($user_id,$countrycode,$mobile,$userType){
        $checkUser=User::findOne(['countrycode'=>$countrycode,'phone'=>$mobile,'groupid'=>$userType]);

SELECT * FROM `user_rating_logs` WHERE `doctor_id`=88 LIMIT 2
---
    public static function getRatingList($doctor_id,$offset,$recordlimit){
        $totalpages=0;$count_result=0;
        $lists= new Query();
        $lists=UserRatingLogs::find();
        $lists->where(['doctor_id'=>$doctor_id]);

        $countQuery = clone $lists;
        $totalpages = new Pagination(['totalCount' => $countQuery->count()]);
        $lists->limit($recordlimit);
        $lists->offset($offset);
        $lists->all();

SELECT * FROM `user_schedule_day` WHERE (`user_id`=88) AND (`weekday`='Tuesday') AND (`date`='2019-02-05') AND (`shift` IS NULL)
SELECT * FROM `user_schedule` WHERE (`user_id`=88) AND (`weekday`='Tuesday') AND (`shift` IS NULL)
SELECT * FROM `user_address` WHERE `id`=101
---
    public static function getShiftDetail($user_id,$week,$shift,$date=''){
        if($date != ''){
            $addSchedule=UserScheduleDay::find()->where(['user_id'=>$user_id,'weekday'=>$week,'date'=>$date,'shift'=>$shift])->one();
            if(empty($addSchedule)){
                $addSchedule=UserSchedule::find()->where(['user_id'=>$user_id,'weekday'=>$week,'shift'=>$shift])->one();
            }
        }
        else{
            $addSchedule=UserSchedule::find()->where(['user_id'=>$user_id,'weekday'=>$week,'shift'=>$shift])->one();
        }
        if(!empty($addSchedule)){

            $schedule=UserSchedule::find()->where(['user_id'=>$user_id,'weekday'=>$week,'shift'=>$shift])->one();

            $address=UserAddress::findOne($addSchedule->address_id);

SELECT * FROM `user_schedule` WHERE `user_id`='44'
---
    public static function getAllShiftDetail($user_id,$week='',$date=''){
        $shifts=[];
        $week_array=DrsPanel::getWeekArray();
        $i=0;
        foreach ($week_array as $key => $dayofweek) {

            $addSchedule=UserSchedule::find()->where(['user_id'=>$user_id,'weekday'=>$dayofweek])->all();

SELECT * FROM `user_rating` WHERE `user_id`=88
---
    public static function getRatingStatus($user_id){
        $user=UserRating::find()->where(['user_id'=>$user_id])->one();

SELECT * FROM `article` WHERE `user_id`=88
---
    public static function getMyArticles($user_id){
        $articles=array();
        $lists=Article::find()->where(['user_id'=>$user_id])->all();

SELECT COUNT(*) FROM `user_appointment` WHERE (`doctor_id`=88) AND (`date`='2019-02-05')
---
    public static function generateToken($doctor_id,$date){
        $appointments=UserAppointment::find()->where(['doctor_id'=>$doctor_id,'date'=>$date])->count();

SELECT * FROM `meta_values` WHERE (`key`=11) AND (`value`='OT')
---
    public static function getMetaData($keyname,$user_id=''){
        $key=MetaKeys::findOne(['key'=>$keyname]);
        $groups_v=array();
        if(!empty($key)){
            $metavalues=MetaValues::find()->where(['key'=>$key->id,'status'=>1])->all();

SELECT `uP`.`avatar` AS `image`, `uP`.`avatar_base_url` AS `base_path`, `uP`.`avatar_path` AS `file_path`, `uP`.`name` AS `label`, `uP`.`user_id` AS `id` FROM `user` LEFT JOIN `user_profile` `uP` ON `user`.`id` = `uP`.`user_id` WHERE (`uP`.`groupid`=5) AND (`user`.`status`=2)
SELECT * FROM `user_profile` WHERE (`groupid`=5) AND (`user_id`='10')
SELECT * FROM `meta_values` WHERE (`status`=1) AND (`Key`=5) AND (`value` IN ('Dermatologist / Hair', 'Skin', 'Nails', 'Cardiologist / Heart Specialist', 'Gastroenterologist', 'Psychiatrist / Psychologist', 'Ear-Nose-Throat (ENT) Specialist'))
SELECT * FROM `meta_values` WHERE (`status`=1) AND (`Key`=9) AND (`value` IN ('Concurrent Chemoradiation', 'Nutritional Management in Cancer Patients', 'Pain Management', 'Preventive Oncology & Cancer Screening'))
---
    public function homeScreenData(){
        $lists= new Query();
        $lists=User::find();
        $lists->joinWith('userProfile as uP');
        $lists->andwhere(['uP.groupid'=>Groups::GROUP_HOSPITAL]);
        $lists->andWhere(['user.status'=>User::STATUS_ACTIVE]);//'user.admin_status'=>User::STATUS_ADMIN_APPROVED
        $lists->select(['uP.avatar as image','uP.avatar_base_url as base_path','uP.avatar_path as file_path','uP.name as label','uP.user_id as id']);
        $lists->all();
        $command = $lists->createCommand();
        $lists = $command->queryAll();
        $slider_limit =MetaValues::find()->andWhere(['status'=>1])->andWhere(['Key'=>13])->one();
        // pr($slider_limit->value);die;
        $sliderImg=SliderImage::find()->andWhere(['status'=>1])->limit($slider_limit->value)->all();
        // $hospitals=User::find()->andWhere(['status'=>User::STATUS_ACTIVE])->andWhere(['groupid'=>Groups::GROUP_HOSPITAL])->all();
        $speciality ='';
        $popularspeciality=PopularMeta::find()->andWhere(['status'=>1])->andWhere(['key'=>'speciality'])->all();
        if(!empty($popularspeciality)) {
            $findSpeciality = explode(',', $popularspeciality[0]['value']);
            $speciality=MetaValues::find()->andWhere(['status'=>1])->andWhere(['Key'=>5])->andwhere(['value' => $findSpeciality])->all();

SELECT * FROM `user_address` WHERE (`user_id`='105') AND (`status`=1) ORDER BY `id` DESC
---
    public static function doctorHospitalList($id){
        $reqUserSearch=['status'=>UserRequest::Request_Confirmed,'request_to'=>$id,'groupid'=>Groups::GROUP_HOSPITAL];
        $requested=UserRequest::requestedUser($reqUserSearch,'request_to');
        $query = UserAddress::find()->andWhere(['user_id'=>$id,'status'=>1]);

SELECT * FROM `user_profile` WHERE `user_id`='188'
---
     public static function doctorSearchList($search=array()){
         $lists= new Query();
         $lists=UserProfile::find();

SELECT * FROM `user_profile` WHERE `user_id`=88
---
    public static function getUserAvator($user_id,$type=''){
        $profile =  UserProfile::findOne(['user_id' => $user_id]);

SELECT * FROM `user` WHERE `id`=88
---
public static function getDoctorProfileMsg($user_id){
    $profile =  User::findOne(['id' => $user_id]);

SELECT * FROM `user_schedule` WHERE (`user_id`=88) AND (`weekday`='Tuesday')
---
            $dateSchedule=UserScheduleDay::find()->where(['user_id'=>$doctor_id,'weekday'=>$weekday,'date'=>$date,'shift'=>$shift->shift])->one();

            if(empty($dateSchedule)){
                $dateSchedule=UserSchedule::find()->where(['user_id'=>$doctor_id,'weekday'=>$weekday,'shift'=>$shift->shift,'id'=>$shift->schedule_id])->one();

INSERT INTO `user_schedule_group` (`user_id`, `schedule_id`, `shift_belongs_to`, `attender_id`, `hospital_id`, `address_id`, `shift`, `shift_label`, `start_time`, `end_time`, `date`, `weekday`, `status`, `booking_closed`, `created_at`, `updated_at`) VALUES (88, 366, 'attender', '0', 0, 101, NULL, 'Shift 06:00 am - 07:00 am', 1549067400, 1549071000, '2019-02-06', 'Wednesday', 'pending', 1, 1549345320, 1549345320)
---
                    $schedulegroup->weekday=$weekday;
                    $schedulegroup->status='pending';
                    $schedulegroup->booking_closed=$dateSchedule->booking_closed;
                    $schedulegroup->save();

SELECT * FROM `user_address` WHERE `id`=153
---
    public static function getDisplayAddress($user_id){
        $address =  UserAddress::findOne(['user_id' => $user_id]);

SELECT * FROM `user_address` WHERE `id`=153
---
    public static function getTitleDisplayAddress($user_id){
        $address =  UserAddress::findOne(['user_id' => $user_id]);