common/models/MetaValues.php

SELECT * FROM `meta_values` WHERE `key`=3 ORDER BY `id`
---
    public function socialLinks()
    {
       return MetaValues::find()->orderBy('id asc')->andWhere(['key'=>3])->all();

SELECT * FROM `meta_values` WHERE `label`='copyright'
---
    public function copyright()
    {
        $copyrightText = MetaValues::find()->where(['label'=>'copyright'])->one();