frontend/views/search/_search_filter.php

SELECT * FROM `meta_values` WHERE `key`=5 ORDER BY `id`
SELECT * FROM `meta_values` WHERE `key`=9 ORDER BY `id`
---
use common\models\UserProfile;
use common\models\MetaValues;
use common\components\DrsPanel;
$specialities = MetaValues::find()->orderBy('id asc')
            ->where(['key'=>5])->all();
$treatments = MetaValues::find()->orderBy('id asc')
            ->where(['key'=>9])->all();