frontend/modules/user/controllers/DoctorController.php

SELECT * FROM `user_profile` WHERE `user_id`=88
---
    public function actionProfile(){
        $id=Yii::$app->user->id;
        $userModel=$this->findModel($id);
        $groupid = Groups::GROUP_DOCTOR;
        $userProfile=UserProfile::findOne(['user_id'=>$id]);

SELECT * FROM `user_profile` WHERE (`user_id`=88) AND (`groupid`=5)
SELECT * FROM `meta_values` WHERE (`status`=1) AND (`Key`=9)
SELECT * FROM `user_profile` WHERE (`user_id`=88) AND (`groupid`=4)
---
            }
        }

        $specialityList=UserProfile::find()->andWhere(['user_id'=>$id])->andWhere(['groupid'=>Groups::GROUP_HOSPITAL])->all();

        $speciality=MetaValues::find()->andWhere(['status'=>1])->andWhere(['Key'=>5])->all();

        $treatment=MetaValues::find()->andWhere(['status'=>1])->andWhere(['Key'=>9])->all();

        $treatmentList=UserProfile::find()->andWhere(['user_id'=>$id])->andWhere(['groupid'=>Groups::GROUP_HOSPITAL])->all();

SELECT * FROM `user_profile` WHERE `user_id`='88'
SELECT * FROM `meta_values` WHERE `value`='ENT'
SELECT * FROM `meta_values` WHERE (`status`=1) AND (`key`=9) AND (`parent_key`=44)
SELECT * FROM `meta_values` WHERE (`parent_key`=44) AND (`value`='test')
---
    public function actionAjaxTreatmentList(){
        if(Yii::$app->request->isAjax && Yii::$app->request->post()){
            $form = ActiveForm::begin(['id' => 'profile-form']);
            $post=Yii::$app->request->post();
            $treatment_list=[];
            if(isset($post['id']) && !empty($post['user_id'])){
                $userProfile=UserProfile::findOne(['user_id'=>$post['user_id']]);
                $key=MetaValues::findOne(['value'=>$post['id']]);
                $treatments=MetaValues::find()->andWhere(['status'=>1,'key'=>9,'parent_key'=>$key->id])->all();
                $all_active_values=array();
                foreach ($treatments as $treatment) {
                    $all_active_values[]=$treatment->value;
                    $treatment_list[$treatment->value] = $treatment->label;
                }

                $treatments=$userProfile->treatment;
                if(!empty($treatments)){
                    $treatments=explode(',',$treatments);
                    foreach($treatments as $treatment){
                        if(!in_array($treatment,$all_active_values)){
                            $checkValue=MetaValues::find()->where(['parent_key'=>$key->id,'value'=>$treatment])->one();

SELECT * FROM `user` WHERE `id`=88
---
    public function actionBookingConfirm(){
        if(Yii::$app->request->isAjax && Yii::$app->request->post()){
            $post=Yii::$app->request->post();
            $slot_id=explode('-',$post['slot_id']);

            $id=Yii::$app->user->id;
            $doctorProfile=UserProfile::find()->where(['user_id'=>$id])->one();
            if(!empty($doctorProfile)){
                $doctor=User::findOne($doctorProfile->user_id);
                $slot=UserScheduleSlots::find()->andWhere(['user_id'=>$doctor->id,'id'=>$slot_id[1]])->one();
                if($slot){
                    $schedule=UserSchedule::findOne($slot->schedule_id);
                    $model= new AppointmentForm();
                    $model->doctor_id=$doctor->id;
                    $model->slot_id=$slot->id;
                    $model->schedule_id=$slot->schedule_id;
                    return $this->renderAjax('/common/_booking_confirm.php',
                        ['doctor'=>$doctor, 'slot'=>$slot, 'schedule'=>$schedule,   'address'=>UserAddress::findOne($schedule->address_id), 'model'=> $model, 'userType'=>'doctor'
                        ]);