frontend/modules/user/controllers/SignInController.php

    public function actionLogin(){
        $error=true;
        $model = new LoginFormType();
        $model->scenario = 'login';
        if (Yii::$app->request->isAjax) {
            $model->load($_POST);
            Yii::$app->response->format = Response::FORMAT_JSON;
            return ActiveForm::validate($model);
        }
        if ($model->load(Yii::$app->request->post())) {

            if($userModel=$model->OtpScreen()) {
                $userModel->otp=1234;
                $userModel->save();
---
UPDATE `user` SET `otp`='123456', `updated_at`=1537938908 WHERE `id`=44

    public function actionOtpVerify(){
        $model = new LoginForm();
        $model->scenario = 'otp';
         if (Yii::$app->request->isAjax) {
                $model->load($_POST);
                Yii::$app->response->format = Response::FORMAT_JSON;
                return ActiveForm::validate($model);
        }
        if (Yii::$app->request->post()){
            $model->load(Yii::$app->request->post());
            if($model->getUser()){
                if($model->login()){
                    $groupid=Yii::$app->user->identity->userProfile->groupid;
---
SELECT * FROM `user_profile` WHERE `user_id`=88